In [ ]:
#reading the data

In [1]:


import MySQLdb
import datetime
from MySQLdb import Error
import pandas as pd
# import pygsheets #Importing python in google sheets

# localhost = "everest.casyoiozkia2.ap-south-1.rds.amazonaws.com" 
# pythonuser = "himani" #user_name of database
# pythonpwd123 = "Himani@EverestFleet@1234" #password 
# database = "jarvis" #database to connect to

localhost = "localhost" #IP Address of database
pythonuser = "root" #user_name of database
pythonpwd123 = "root" #password for username
database = "testdb" #database to connect to
try:
    dbconnect = MySQLdb.connect(host = localhost, user = pythonuser, password = pythonpwd123, database = database)
    
    if dbconnect.get_server_info():
        print("Connected to MySQL Server, version is",dbconnect.get_server_info())
        
        #getting from database
        
        try:
            cur = dbconnect.cursor()
            day = int(input('Enter Week Start Date:'))
            month = int(input('Enter the month:'))
            year = int(input('Enter the year:'))
            last_week_day = datetime.date(year,month,day)
            print(last_week_day)
            sql=(" SELECT * FROM test_fleet WHERE date_of_joining='%s-%s-%s' ")
            cur.execute(sql, (year,month,day))
            query = "DELETE FROM test_fleet WHERE date_of_joining ='%s-%s-%s' "
            cur.execute(query, (year,month,day))
            dbconnect.commit()
            print("succesfully deleted")
                    
            Fleet_driver_2_record = cur.fetchall()
            Fleet_driver_2_df = pd.DataFrame(Fleet_driver_2_record)
        except Error as e:
            print("Error:",e)
# Fleet_driver_2_df.head(10)
            
        cur.execute("SELECT * FROM test_fleet WHERE date_of_joining='2022-06-05' ")                   
except Error as e:
    print("Error:",e)

Connected to MySQL Server, version is 8.0.29
Enter Week Start Date:04
Enter the month:06
Enter the year:2022
2022-06-04
succesfully deleted

In [14]:
query="SELECT * FROM tablename Where IS NULL"

Empty DataFrame
Columns: []
Index: []

In [9]:


import MySQLdb
import datetime
from MySQLdb import Error
import pandas as pd
import pygsheets #Importing python in google sheets

# localhost = "everest.casyoiozkia2.ap-south-1.rds.amazonaws.com" 
# pythonuser = "himani" #user_name of database
# pythonpwd123 = "Himani@EverestFleet@1234" #password 
# database = "jarvis" #database to connect to

localhost = "localhost" #IP Address of database
pythonuser = "root" #user_name of database
pythonpwd123 = "root" #password for username
database = "testdb" #database to connect to
try:
    dbconnect = MySQLdb.connect(host = localhost, user = pythonuser, password = pythonpwd123, database = database)
    
    if dbconnect.get_server_info():
        print("Connected to MySQL Server, version is",dbconnect.get_server_info())
        
        #getting from database
        
        try:
            cur = dbconnect.cursor()
            sql=("SELECT * FROM test_fleet WHERE date_of_joining IS NULL;")
            dfm=cur.execute(sql)
            etp_record = cur.fetchall()
            etp_df = pd.DataFrame(etp_record)
            etp = etp_df.set_axis(['id', 'city_id','name','doj','ed','rd'], axis='columns')  

        except Error as e:
            print("Error:",e)
            
except Error as e:
    print("Error:",e)
    
etp

Connected to MySQL Server, version is 8.0.29

   id  city_id   name        doj  ed    rd
0   1  ETM0001   AMIT  123456789   1  None
1   2  ETM0002  SUMIT  987654321   2  None
2   3  ETM0003  rohan   81818188   1  None

In [9]:

import MySQLdb
import datetime
from MySQLdb import Error
import pandas as pd
import pygsheets #Importing python in google sheets

In [2]:
year = int(input('Enter the year:'))
month = int(input('Enter the month:'))
day = int(input('Enter Week Start Date:'))
data=str(year)+'-'+'0'+str(month)+'-'+'0'+str(day)
# print(data)
last_week_day = datetime.date(year,month,day)
print(last_week_day)

Enter the year:2022
Enter the month:06
Enter Week Start Date:05
2022-06-05

In [12]:
year = int(input('Enter the year:'))
month = int(input('Enter the month:'))
day = int(input('Enter Week Start Date:'))
d = "{year}-{month}-{day}".format(year,month,day)
print(d)

SyntaxError: invalid syntax (Temp/ipykernel_13572/3922181811.py, line 4)

In [ ]:
#updating the data

In [3]:


import MySQLdb
from MySQLdb import Error
import pandas as pd
import pygsheets #Importing python in google sheets

# localhost = "everest.casyoiozkia2.ap-south-1.rds.amazonaws.com" 
# pythonuser = "himani" #user_name of database
# pythonpwd123 = "Himani@EverestFleet@1234" #password 
# database = "jarvis" #database to connect to

localhost = "localhost" #IP Address of database
pythonuser = "root" #user_name of database
pythonpwd123 = "root" #password for username
database = "testdb" #database to connect to
try:
    dbconnect = MySQLdb.connect(host = localhost, user = pythonuser, password = pythonpwd123, database = database)
    
    if dbconnect.get_server_info():
        print("Connected to MySQL Server, version is",dbconnect.get_server_info())
        
        #getting from database
        
        cur = dbconnect.cursor()
        date_inp=input("Enter date ")
        id_inp=input("Enter id ")
        sql=' UPDATE test_fleet SET date_of_joining = %s WHERE id = %s '
        cur.execute(sql, (date_inp,id_inp))
        print("query updated ")
#         cur.execute('Select * from test_fleet')
                    
except Error as e:
    print("Error:",e)

Connected to MySQL Server, version is 8.0.29
Enter date 2022-05-06
Enter id 2
query updated

In [18]:
Fleet_driver_2_df

Empty DataFrame
Columns: []
Index: []